CSI API ETABS v1
cPointObj.GetCoordCartesian Method
 Retrieves the x, y and z coordinates of the specified point object in the Present Units.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetCoordCartesian(
	string Name,
	ref double X,
	ref double Y,
	ref double Z,
	string CSys = "Global"
)
Function GetCoordCartesian (
	Name As String,
	ByRef X As Double,
	ByRef Y As Double,
	ByRef Z As Double,
	Optional CSys As String = "Global"
) As Integer
Dim instance As cPointObj
Dim Name As String
Dim X As Double
Dim Y As Double
Dim Z As Double
Dim CSys As String
Dim returnValue As Integer
returnValue = instance.GetCoordCartesian(Name,
	X, Y, Z, CSys)
int GetCoordCartesian(
	String^ Name,
	double% X,
	double% Y,
	double% Z,
	String^ CSys = L"Global"
)
abstract GetCoordCartesian :
        Name : string *
        X : float byref *
        Y : float byref *
        Z : float byref *
        ?CSys : string
(* Defaults:
        let _CSys = defaultArg CSys "Global"
*)
-> int
Parameters
Name
Type: System.String
 The name of a defined point object.
X
Type: System.Double
 The X-coordinate of the specified point object in the specified coordinate system. [L]
Y
Type: System.Double
 The Y-coordinate of the specified point object in the specified coordinate system. [L]
Z
Type: System.Double
 The Z-coordinate of the specified point object in the specified coordinate system. [L]
CSys (Optional)
Type: System.String
 The name of a defined coordinate system. If Csys is not specified, the Global coordinate system is assumed.
Return Value
Type: Int32
 Returns zero if the coordinates are successfully returned; otherwise it returns nonzero.
Remarks
 The coordinates are reported in the coordinate system specified by CSys.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim x As Double, y As Double, z As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
   'get point coordinates
       ret = SapModel.PointObj.GetCoordCartesian("1", x, y, z)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPointObj Interface
ETABSv1 Namespace